{"status":"ok","feed":{"url":"https://medium.com/feed/@IvooO","title":"Stories by IvooO on Medium","link":"https://medium.com/@IvooO?source=rss-5652217be6ca------2","author":"","description":"Stories by IvooO on Medium","image":"https://cdn-images-1.medium.com/fit/c/150/150/0*jr5q0ID1rpB0KDB_."},"items":[{"title":"Blockchain Technology in The Food Industry","pubDate":"2022-05-02 13:59:19","link":"https://medium.com/@IvooO/blockchain-technology-in-the-food-industry-ddf2d34cced6?source=rss-5652217be6ca------2","guid":"https://medium.com/p/ddf2d34cced6","author":"IvooO","thumbnail":"https://cdn-images-1.medium.com/max/1024/1*36IBheriygxPL8KkKOmLMg.jpeg","description":"\n<p>Download the report from Deloitte: <a href=\"https://www2.deloitte.com/au/en/pages/consumer-business/articles/blockchain-food-industry-radical-transparency.html\">https://www2.deloitte.com/au/en/pages/consumer-business/articles/blockchain-food-industry-radical-transparency.html</a></p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*36IBheriygxPL8KkKOmLMg.jpeg\"></figure><p>Globalization makes the food system even more complex with multiple suppliers and companies involved. However, that has created a challenge in maintaining food security even where laws and policies have been published. The frequent occurrences of food scandals have reduced consumers’ trust in the food industry. The food safety issues arise due to operational mistakes, including contamination, mislabeling, undeclared ingredient, biological causes, etc.</p>\n<p>Some of the most well-known food scandals in history are the China 2008 <a href=\"https://www.forbes.com/sites/yanzhonghuang/2014/07/16/the-2008-milk-scandal-revisited/#2ccd62fe4105\">Sanlu milk scandal</a>, the Germany 2011 Enterohemorrhagic <em>E.coli</em> outbreak due to <a href=\"http://www.outbreakdatabase.com/details/2011-outbreak-of-e.-coli-o104h4-linked-to-fenugreek-sprouts/?\">contaminated fenugreek sprouts</a>, Europe 2013 <a href=\"https://www.bbc.com/news/uk-21335872\">horse meat scandal</a> — a food labelling fraud, the <a href=\"https://www.fda.gov/food/outbreaks-foodborne-illness/fda-investigates-multiple-salmonella-outbreak-strains-linked-papayas\">US 2017 multi-state <em>Salmonella</em> outbreak</a> of Maradol papayas, the 2017 <a href=\"https://www.theguardian.com/world/2017/aug/11/tainted-eggs-found-in-hong-kong-switzerland-and-15-eu-countries#:~:text=Europe's%20latest%20food%20scandal%20has,insecticide%20harmful%20to%20human%20health.\">contaminated egg scandal</a> in Switzerland, Hong Kong, and EU-15 states and the US 2018 <a href=\"https://www.fda.gov/food/outbreaks-foodborne-illness/outbreak-investigation-e-coli-romaine-november-2018#:~:text=Information%20collected%20through%20December%206,coli%20O157%3AH7%20infections.\">outbreak of <em>E. coli</em> of Romaine lettuce</a>.</p>\n<p>Tragically, more food poisoning outbreaks reported in 2019–2020. For instance, an outbreak of <em>Salmonella</em> Newport illness that was linked to <a href=\"https://www.cdc.gov/media/releases/2019/s0416-salmonella-outbreak-tuna.html\">frozen ground tuna</a> in America, <em>Salmonella</em>–<a href=\"https://www.foodsafetynews.com/2020/07/salmonella-outbreak-linked-to-british-eggs/#:~:text=Almost%2040%20people%20are%20part,illness%20for%20all%20the%20patients.\">infected British eggs</a>, the Netherlands <em>Listeria monocytogenes</em> <a href=\"https://www.foodsafetynews.com/2020/06/deaths-linked-to-dutch-listeria-outbreak-double/\">infected meat</a>. Ultimately, these incidents raised food safety concerns among consumers which changed their buying behaviour.</p>\n<p>Therefore, all the stakeholders should share the responsibility of food security, including food producers, food retailers, related governments, and customers. Supply chain management is playing a significant role in addressing food insecurity and contribute to food recall and public health. All these can be accomplished through technological innovations for efficient traceability system.</p>\n<p>The digitalization of the supply chain can achieve strategic improvements for agri-food companies. Most recently, blockchain has drawn significant attention that could revolutionize society to solve food traceability issues.</p>\n<p><em>This article looks into presenting what is blockchain technology, how it can be important and beneficial for the agri-food industry. Also, the application of blockchain technology in the food industry.</em></p>\n<h3>What is Blockchain Technology?</h3>\n<p>The blockchain technology was developed to innovate financial transactions using Bitcoins, as currency exchange and cheap reliable global payment system. It bypasses the traditional financial intermediaries like banks.</p>\n<p>Blockchain technology is a record-keeping distributed database of shared public ledgers, a more efficient way to record and exchange information. Whereby, no single person, or a company, or a government, or an entity, owns the data.</p>\n<p>Blockchain is an expanding list of records, called blocks linked by <a href=\"https://searchsecurity.techtarget.com/definition/cryptography\">cryptography</a>. Each block contains a data set, timestamp, cryptographic hash (cybersecurity fingerprint) and the hash of the previous block. By design, a blockchain is resistant to alteration of the data. The infographic below illustrates how blockchain works:</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*nf8DIxovH9E30qTO.jpg\"></figure><p><em>Source: Gary Fox</em></p>\n<h3>The 4 Main Attributes of Blockchain Technology</h3>\n<h4>1. Decentralization</h4>\n<p>Allows authorized users to have the same power to upload and check information. Unlike traditional transactions that need to be approved by central authorities. Thus, blockchain eliminates the central powers and addresses information inequality by allowing for a direct transaction between the users.</p>\n<h4>2.Security</h4>\n<p>Prevents break down of the whole network because a single point failure will not lead to the failure of the whole network, which can minimize the chance of hacking.</p>\n<h4>3. Immutability</h4>\n<p>Ensures the records’ originality and authenticity. Meaning that historic data cannot be modified without notifying other users. Hence, this can reduce the human intervention on records.</p>\n<h3>4. Smart contract</h3>\n<p>A digitalized contract and operates automatically once pre-established conditions are met. This can fasten the transactions and improve trust. No single users can make changes on contract as it is based on the agreement of all members in the network.</p>\n<h3>Importance of Blockchain Technology in The Food Industry</h3>\n<p>Now, why would blockchain, a technology originally developed for financial management and cryptocurrencies, be important for the food industry?</p>\n<p>When compared to other industries, the value chains of the food industry are more vulnerable. It requires more attention to production, post-harvest handling, processing, transportation, marketing, distribution and retailing especially when dealing with the seasonal and time-sensitive products.</p>\n<p>On top of it, food has a natural characteristic of changing in quality constantly. Furthermore, external environments such as temperature and shipping can change food products’ quality and freshness. Besides that, processed food with a longer shelf life might involve complicated production process with a mixture of many ingredients. Those complications contribute to higher risks of product failure and need to be extra careful with the quality of raw material. So, these are the major challenges the food industry facing today where blockchain technology can be a promising solution.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*8JJAY5UwpdZl_B1K.png\"></figure><p>Blockchain technology guarantees the traceability and authenticity of information that would impact the food supply chain dramatically. Furthermore, smart contractual relationships create a trusted environment such as enforcing product authenticity certification and ownership certification of suppliers. The certificates are permanently registered along the chain. Thus, the technology controls the risk of supply chain members moving fraudulent foods.</p>\n<p>IDC predicted by 2021, about 30% of manufacturers and retailers globally will have built digital trust through blockchain services. So, that enable collaborative supply chains and allow consumers to access product histories as well as reduces transaction costs by 35%.</p>\n<h3>Benefits of Blockchain Technology in The Food Industry</h3>\n<h3>1. Strengthen Supply Chain Management</h3>\n<p>Blockchain can improve transparency, security, and robustness of the food supply chain. The technology provides a shared information platform for all partners in the supply chain. It verifies the origin of food products or raw materials, real-time location, and status of the product at any step to monitor inventory and quality standard along the supply chain. In addition, it gathers detailed information such as product temperature, environmental conditions and other important factors for quality management purposes, which is particularly important for perishable products.</p>\n<p>Most importantly, it secures the collected records as it reduces the risks of data stealing and hacking. As a result, blockchain technology helping companies to create a more informed and predictable supply chain as well as they gain 360 views of entire supply chain activities.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*MFpQr9vkMZ6VudlZ.jpg\"></figure><h3>2. Mitigate food fraud while protecting the brand</h3>\n<p>Data on a blockchain is permanently stored and maintained by all stakeholders within the supply chain network. Blockchain’s biggest importance is in providing traceability for everyone on the chain — from farmers through manufacturers, wholesalers, retailers and consumers. Multiple stakeholders can have direct product profile access, save the copies of records, also can be retrieved on-demand anytime. For instance, manufacturers can monitor their suppliers to make sure that raw material quality meets requirements. Whereas, the end-users, consumers can trace the product’s journey to determine its origin and guarantee their authenticity.</p>\n<p>Meanwhile, the full transparency of data helps brand owners to quickly and proactively identify the source of contamination. So, they can manage potentially harmful food fraud without disrupting the whole supply chain.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*C5BF8v7-m34GjUs-.png\"></figure><h3>3. Built trust and loyalty of consumers</h3>\n<p>A blockchain-based supply chain builds trust amongst supply chain stakeholders in the way food products are manufactured, processed and delivered. Because the data uploaded visible to anyone within the network that is error-free, cannot be manipulated or hacked. Thus, this brings transparency and trust to the complex supply chain. It protects every stakeholder’s benefits and eliminates information inequality.</p>\n<p>Blockchain helps boost consumer confidence with automatic digitizing and easily sharing audits, certificates, and other relevant records on sustainable practices. It also acts as evidence for containing products, such as halal food, organic food, fair trade food, etc. So, consumers will assume better quality, which will increase their purchasing decision power.</p>\n<h3>4. Food supervision</h3>\n<p>According to the <a href=\"https://www.who.int/health-topics/food-safety/\">WHO</a>, almost 1 in 10 people globally suffer illness due to eating contaminated food globally, resulting in 420 000 deaths of which 125 000 are children under 5 years old. Fortunately, a blockchain-technology eliminates counterfeit products along the food supply chain. Blockchain can notify foodborne outbreaks. Also, it analyzes the root cause of the outbreaks since the food market transaction information is already been recorded. Subsequently, the number of disease outbreaks and victims can be reduced. Moreover, Immutability feature of blockchain is specifically useful during food recall, which can prevent any related stakeholders to change history and escape from responsibilities.</p>\n<h3>5. Prevents price coercion</h3>\n<p>Blockchain technology applications in the food industry reduce transaction fees and middlemen or intermediaries. Consequently, intermediates would get less chance to collect more money from farmers or manufactures. So, food producers can reap better and significant economic benefits. Plus, the consumer gets the premium quality products delivered by brands with a good reputation at reasonable prices.</p>\n<h3>6. Prevents food wastage</h3>\n<p>According to the <a href=\"http://www.fao.org/news/story/en/item/74192/icode/\">United Nations’ Food and Agriculture Organization</a>, around 1.3 billion tons which are approximately one-third of food produced in the world gets wasted yearly.</p>\n<p>By blockchain-based traceability, it is possible to track the quantity of food wasted and food rescued throughout the entire supply chain. Thus, this leading to reduced product loss and increased margins. Moreover, the stakeholders can regulate the operation of the supply chain in a charitable manner as they can arrange food aid for families struggling with hunger and malnutrition.</p>\n<p>Notably, untargeted food recall is one of the major causes of food wastage. Blockchain technology can improve food recall efficiency. You can retrieve needed information, isolate products from certain suppliers, and narrow down the products recall range. It can help to remove certain products and ingredients from the root of the problem immediately to prevent further loss.</p>\n<p>On the other hand, Food Marketing Institute and the Grocery Manufacturers Association revealed that a company’s <a href=\"https://www.foodsafetymagazine.com/signature-series/recall-the-food-industrys-biggest-threat-to-profitability/\">average cost of a food recall is $10M</a> — in addition to brand damage and lost sales according to a joint industry.</p>\n<h3>7. Sustainability</h3>\n<p>Food companies are encouraged to be more sustainable as the traceability feature of blockchain able to monitor environmental impacts. The traditional traceability system mainly depends upon paper-based systems and cause difficulties for stakeholders’ integration. Moreover, paper documentation can be time-consuming and cause human errors. Yet, blockchain’s smart contract can save paperwork, minimize human labour efforts and reduce unnecessary costs. For instance, the payment can be transferred to producers automatically once the products arrive at the warehouse.</p>\n<p>Furthermore, the global supply chains become more complex with diverse policies to adapt in different countries. Globalized standardization can be adaptable for all countries by applying blockchain. So, companies can avoid duplicative works as well as can save resources and time.</p>\n<h3>8. Integration with Enterprise resource planning (ERP) and Internet of things (IoT)</h3>\n<p>Integrating ERP, IoT with blockchain technology can be highly beneficial. Enterprise resource planning (ERP) <a href=\"https://axxis-consulting.com/inventory-warehouse-management-module/\">streamlines inventory and production management processes</a> includes trade, logistics, delivery, warehousing information. While, IoT is an intelligent and high-speed information network that connects physical products through sensor includes GPS, GIS, RFID, WSN, etc.</p>\n<p>IoT devices capture accurate and real-time data in a continuous stream that can automatically feed into the internal ERP systems. Thus, no more manual recording or no human effort required to scan a barcode. This real-time information capturing ability is particularly important for frozen and fresh food products, as the quality is closely related to the external environment.</p>\n<p>The synergy between ERP, IoT and blockchain foster the exchange of immutable data along the supply chain and the smart contracts accelerate processing time. Analysis of massive quantities of reliable data leads to the right decisions. So, you can transform your operations from a reactive to a proactive approach.</p>\n<h3>Application of Blockchain technology in The Food Industry</h3>\n<p>Some prominent organizations have cooperated blockchain technology and enhanced their supply chains organizationally and technologically such as:</p>\n<h3>1. Walmart</h3>\n<p>Walmart collaborated with Chinese retailer JD.com, and Tsinghua University <a href=\"https://www.forbes.com/sites/rogeraitken/2017/12/14/ibm-walmart-launching-blockchain-food-safety-alliance-in-china-with-fortune-500s-jd-com/#4bc210967d9c\">to handle product safety issues</a> in food supply chains in China. Besides that, they are <a href=\"https://theleadershipnetwork.com/article/how-walmart-used-blockchain-to-increase-supply-chain-transparency\">tracing over 25 products</a> such as fresh fruits, leafy greens, dairy, meat, poultry from different suppliers. Beyond tracking the origin of products, Walmart aims to address food safety issues by identifying the source of a foodborne disease outbreak. Walmart will be coordinating more effective recalls of foods potentially contaminated. Moreover, it’s considering storing additional data to facilitate sustainable practices in the supply chain.</p>\n<h4>2. JD.com</h4>\n<p>JD.com China’s second-biggest online shopping has made it possible for customers to look at a <a href=\"https://qz.com/1031861/blockchain-could-fix-a-key-problem-in-chinas-food-industry-the-fear-of-food-made-in-china/\">detailed history of their steaks</a> — from when the cow was born to what it was eating before it’s served on their dinner tables.</p>\n<h3>3. Barilla</h3>\n<p>Barilla is using blockchain technology to guarantee the origin and quality of Italian fresh basil for its pesto.</p>\n<h3>4. Nestle and Carrefour</h3>\n<p>Nestle and Carrefour track baby milk products and provide consumers with data on their origins and movements “<a href=\"https://www.coindesk.com/nestle-carrefour-extend-blockchain-tracking-effort-to-baby-milk\">from dairy to shelf</a>.” Customers will be able to scan a QR code on the milk’s packaging to access a range of information.</p>\n<p>In addition, Carrefour also allows consumers to scan the QR Code on a product’s label such as organic chickens and Sicilian oranges and lemons to <a href=\"https://www.carrefour.com/en/group/food-transition/food-blockchain\">access information on their smartphone</a>.</p>\n<p>Most recently, Nestlé has announced that it will be expanding its use of blockchain technology to trace their <a href=\"https://www.forbes.com/sites/darrynpollock/2020/04/15/nestl-expands-use-of-ibm-food-trust-blockchain-to-its-zogas-coffee-brand/#20997f941684\">luxury coffee brand Zoégas</a>. Consumers can simply scan the QR code on the packaging and follow the coffee journey — from the growing locations to the Zoégas factory where the beans are roasted, grounded and packed. The data includes information about farmers, time of harvest, transaction certificate for the specific shipments, as well as the roasting period.</p>\n<h3>5. Alibaba</h3>\n<p>Alibaba has launched an initiative called “<a href=\"https://www.fastgrowthbrands.com/2018/05/weekly-focus-alibaba-trials-blockchain-for-supply-chain-transparency/\">Food Trust Framework</a>” which allows Chinese customers of Tmall Global (Alibaba-owned marketplace) to monitor shipments of food from Australia and New Zealand.</p>\n<h3>6. World Wildlife Fund (WWF)</h3>\n<p>The World Wildlife Fund (WWF) in Australia, Fiji and New Zealand, in partnership with high-tech, tuna fishing and processing companies, has launched a pilot project in the Pacific Islands tuna industry that will use <a href=\"https://www.business-humanrights.org/en/australia-wwf-partners-with-tech-cos-to-track-supply-chains-involved-in-environmental-harm-human-rights-abuses\">blockchain technology to fight against illegal tuna fishing</a> and to certify the origin of tuna through a QR Code.</p>\n<h3>Final words</h3>\n<p>By applying blockchain technology, companies in the food supply chain can communicate transparently to consumers and regulators. Moreover, it raises awareness about sustainability opportunities and practices at each step of the supply chain. Substantively, blockchain technology improves brand equity, reputation, and trustful relationships with consumers.</p>\n<blockquote>\n<em>“Blockchain is driving a new breed of enterprise applications that could drastically improve cooperation for wholesale distribution. The blockchain-based solution from SAP provides the best opportunity to fully satisfy our need to be interoperable with our trading partners and their solutions as well as to remain compliant with the U.S. DSCSA.”<br>– </em><a href=\"https://icn.sap.com/article/new-blockchain-software-from-sap-helps-eliminate-counterfeit-drugs\"><em>Jeffery Denton</em></a><em>, senior director, Global Secure Supply Chain, AmerisourceBergen Corporation.</em>\n</blockquote>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=ddf2d34cced6\" width=\"1\" height=\"1\" alt=\"\">\n","content":"\n<p>Download the report from Deloitte: <a href=\"https://www2.deloitte.com/au/en/pages/consumer-business/articles/blockchain-food-industry-radical-transparency.html\">https://www2.deloitte.com/au/en/pages/consumer-business/articles/blockchain-food-industry-radical-transparency.html</a></p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*36IBheriygxPL8KkKOmLMg.jpeg\"></figure><p>Globalization makes the food system even more complex with multiple suppliers and companies involved. However, that has created a challenge in maintaining food security even where laws and policies have been published. The frequent occurrences of food scandals have reduced consumers’ trust in the food industry. The food safety issues arise due to operational mistakes, including contamination, mislabeling, undeclared ingredient, biological causes, etc.</p>\n<p>Some of the most well-known food scandals in history are the China 2008 <a href=\"https://www.forbes.com/sites/yanzhonghuang/2014/07/16/the-2008-milk-scandal-revisited/#2ccd62fe4105\">Sanlu milk scandal</a>, the Germany 2011 Enterohemorrhagic <em>E.coli</em> outbreak due to <a href=\"http://www.outbreakdatabase.com/details/2011-outbreak-of-e.-coli-o104h4-linked-to-fenugreek-sprouts/?\">contaminated fenugreek sprouts</a>, Europe 2013 <a href=\"https://www.bbc.com/news/uk-21335872\">horse meat scandal</a> — a food labelling fraud, the <a href=\"https://www.fda.gov/food/outbreaks-foodborne-illness/fda-investigates-multiple-salmonella-outbreak-strains-linked-papayas\">US 2017 multi-state <em>Salmonella</em> outbreak</a> of Maradol papayas, the 2017 <a href=\"https://www.theguardian.com/world/2017/aug/11/tainted-eggs-found-in-hong-kong-switzerland-and-15-eu-countries#:~:text=Europe's%20latest%20food%20scandal%20has,insecticide%20harmful%20to%20human%20health.\">contaminated egg scandal</a> in Switzerland, Hong Kong, and EU-15 states and the US 2018 <a href=\"https://www.fda.gov/food/outbreaks-foodborne-illness/outbreak-investigation-e-coli-romaine-november-2018#:~:text=Information%20collected%20through%20December%206,coli%20O157%3AH7%20infections.\">outbreak of <em>E. coli</em> of Romaine lettuce</a>.</p>\n<p>Tragically, more food poisoning outbreaks reported in 2019–2020. For instance, an outbreak of <em>Salmonella</em> Newport illness that was linked to <a href=\"https://www.cdc.gov/media/releases/2019/s0416-salmonella-outbreak-tuna.html\">frozen ground tuna</a> in America, <em>Salmonella</em>–<a href=\"https://www.foodsafetynews.com/2020/07/salmonella-outbreak-linked-to-british-eggs/#:~:text=Almost%2040%20people%20are%20part,illness%20for%20all%20the%20patients.\">infected British eggs</a>, the Netherlands <em>Listeria monocytogenes</em> <a href=\"https://www.foodsafetynews.com/2020/06/deaths-linked-to-dutch-listeria-outbreak-double/\">infected meat</a>. Ultimately, these incidents raised food safety concerns among consumers which changed their buying behaviour.</p>\n<p>Therefore, all the stakeholders should share the responsibility of food security, including food producers, food retailers, related governments, and customers. Supply chain management is playing a significant role in addressing food insecurity and contribute to food recall and public health. All these can be accomplished through technological innovations for efficient traceability system.</p>\n<p>The digitalization of the supply chain can achieve strategic improvements for agri-food companies. Most recently, blockchain has drawn significant attention that could revolutionize society to solve food traceability issues.</p>\n<p><em>This article looks into presenting what is blockchain technology, how it can be important and beneficial for the agri-food industry. Also, the application of blockchain technology in the food industry.</em></p>\n<h3>What is Blockchain Technology?</h3>\n<p>The blockchain technology was developed to innovate financial transactions using Bitcoins, as currency exchange and cheap reliable global payment system. It bypasses the traditional financial intermediaries like banks.</p>\n<p>Blockchain technology is a record-keeping distributed database of shared public ledgers, a more efficient way to record and exchange information. Whereby, no single person, or a company, or a government, or an entity, owns the data.</p>\n<p>Blockchain is an expanding list of records, called blocks linked by <a href=\"https://searchsecurity.techtarget.com/definition/cryptography\">cryptography</a>. Each block contains a data set, timestamp, cryptographic hash (cybersecurity fingerprint) and the hash of the previous block. By design, a blockchain is resistant to alteration of the data. The infographic below illustrates how blockchain works:</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*nf8DIxovH9E30qTO.jpg\"></figure><p><em>Source: Gary Fox</em></p>\n<h3>The 4 Main Attributes of Blockchain Technology</h3>\n<h4>1. Decentralization</h4>\n<p>Allows authorized users to have the same power to upload and check information. Unlike traditional transactions that need to be approved by central authorities. Thus, blockchain eliminates the central powers and addresses information inequality by allowing for a direct transaction between the users.</p>\n<h4>2.Security</h4>\n<p>Prevents break down of the whole network because a single point failure will not lead to the failure of the whole network, which can minimize the chance of hacking.</p>\n<h4>3. Immutability</h4>\n<p>Ensures the records’ originality and authenticity. Meaning that historic data cannot be modified without notifying other users. Hence, this can reduce the human intervention on records.</p>\n<h3>4. Smart contract</h3>\n<p>A digitalized contract and operates automatically once pre-established conditions are met. This can fasten the transactions and improve trust. No single users can make changes on contract as it is based on the agreement of all members in the network.</p>\n<h3>Importance of Blockchain Technology in The Food Industry</h3>\n<p>Now, why would blockchain, a technology originally developed for financial management and cryptocurrencies, be important for the food industry?</p>\n<p>When compared to other industries, the value chains of the food industry are more vulnerable. It requires more attention to production, post-harvest handling, processing, transportation, marketing, distribution and retailing especially when dealing with the seasonal and time-sensitive products.</p>\n<p>On top of it, food has a natural characteristic of changing in quality constantly. Furthermore, external environments such as temperature and shipping can change food products’ quality and freshness. Besides that, processed food with a longer shelf life might involve complicated production process with a mixture of many ingredients. Those complications contribute to higher risks of product failure and need to be extra careful with the quality of raw material. So, these are the major challenges the food industry facing today where blockchain technology can be a promising solution.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*8JJAY5UwpdZl_B1K.png\"></figure><p>Blockchain technology guarantees the traceability and authenticity of information that would impact the food supply chain dramatically. Furthermore, smart contractual relationships create a trusted environment such as enforcing product authenticity certification and ownership certification of suppliers. The certificates are permanently registered along the chain. Thus, the technology controls the risk of supply chain members moving fraudulent foods.</p>\n<p>IDC predicted by 2021, about 30% of manufacturers and retailers globally will have built digital trust through blockchain services. So, that enable collaborative supply chains and allow consumers to access product histories as well as reduces transaction costs by 35%.</p>\n<h3>Benefits of Blockchain Technology in The Food Industry</h3>\n<h3>1. Strengthen Supply Chain Management</h3>\n<p>Blockchain can improve transparency, security, and robustness of the food supply chain. The technology provides a shared information platform for all partners in the supply chain. It verifies the origin of food products or raw materials, real-time location, and status of the product at any step to monitor inventory and quality standard along the supply chain. In addition, it gathers detailed information such as product temperature, environmental conditions and other important factors for quality management purposes, which is particularly important for perishable products.</p>\n<p>Most importantly, it secures the collected records as it reduces the risks of data stealing and hacking. As a result, blockchain technology helping companies to create a more informed and predictable supply chain as well as they gain 360 views of entire supply chain activities.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*MFpQr9vkMZ6VudlZ.jpg\"></figure><h3>2. Mitigate food fraud while protecting the brand</h3>\n<p>Data on a blockchain is permanently stored and maintained by all stakeholders within the supply chain network. Blockchain’s biggest importance is in providing traceability for everyone on the chain — from farmers through manufacturers, wholesalers, retailers and consumers. Multiple stakeholders can have direct product profile access, save the copies of records, also can be retrieved on-demand anytime. For instance, manufacturers can monitor their suppliers to make sure that raw material quality meets requirements. Whereas, the end-users, consumers can trace the product’s journey to determine its origin and guarantee their authenticity.</p>\n<p>Meanwhile, the full transparency of data helps brand owners to quickly and proactively identify the source of contamination. So, they can manage potentially harmful food fraud without disrupting the whole supply chain.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/700/0*C5BF8v7-m34GjUs-.png\"></figure><h3>3. Built trust and loyalty of consumers</h3>\n<p>A blockchain-based supply chain builds trust amongst supply chain stakeholders in the way food products are manufactured, processed and delivered. Because the data uploaded visible to anyone within the network that is error-free, cannot be manipulated or hacked. Thus, this brings transparency and trust to the complex supply chain. It protects every stakeholder’s benefits and eliminates information inequality.</p>\n<p>Blockchain helps boost consumer confidence with automatic digitizing and easily sharing audits, certificates, and other relevant records on sustainable practices. It also acts as evidence for containing products, such as halal food, organic food, fair trade food, etc. So, consumers will assume better quality, which will increase their purchasing decision power.</p>\n<h3>4. Food supervision</h3>\n<p>According to the <a href=\"https://www.who.int/health-topics/food-safety/\">WHO</a>, almost 1 in 10 people globally suffer illness due to eating contaminated food globally, resulting in 420 000 deaths of which 125 000 are children under 5 years old. Fortunately, a blockchain-technology eliminates counterfeit products along the food supply chain. Blockchain can notify foodborne outbreaks. Also, it analyzes the root cause of the outbreaks since the food market transaction information is already been recorded. Subsequently, the number of disease outbreaks and victims can be reduced. Moreover, Immutability feature of blockchain is specifically useful during food recall, which can prevent any related stakeholders to change history and escape from responsibilities.</p>\n<h3>5. Prevents price coercion</h3>\n<p>Blockchain technology applications in the food industry reduce transaction fees and middlemen or intermediaries. Consequently, intermediates would get less chance to collect more money from farmers or manufactures. So, food producers can reap better and significant economic benefits. Plus, the consumer gets the premium quality products delivered by brands with a good reputation at reasonable prices.</p>\n<h3>6. Prevents food wastage</h3>\n<p>According to the <a href=\"http://www.fao.org/news/story/en/item/74192/icode/\">United Nations’ Food and Agriculture Organization</a>, around 1.3 billion tons which are approximately one-third of food produced in the world gets wasted yearly.</p>\n<p>By blockchain-based traceability, it is possible to track the quantity of food wasted and food rescued throughout the entire supply chain. Thus, this leading to reduced product loss and increased margins. Moreover, the stakeholders can regulate the operation of the supply chain in a charitable manner as they can arrange food aid for families struggling with hunger and malnutrition.</p>\n<p>Notably, untargeted food recall is one of the major causes of food wastage. Blockchain technology can improve food recall efficiency. You can retrieve needed information, isolate products from certain suppliers, and narrow down the products recall range. It can help to remove certain products and ingredients from the root of the problem immediately to prevent further loss.</p>\n<p>On the other hand, Food Marketing Institute and the Grocery Manufacturers Association revealed that a company’s <a href=\"https://www.foodsafetymagazine.com/signature-series/recall-the-food-industrys-biggest-threat-to-profitability/\">average cost of a food recall is $10M</a> — in addition to brand damage and lost sales according to a joint industry.</p>\n<h3>7. Sustainability</h3>\n<p>Food companies are encouraged to be more sustainable as the traceability feature of blockchain able to monitor environmental impacts. The traditional traceability system mainly depends upon paper-based systems and cause difficulties for stakeholders’ integration. Moreover, paper documentation can be time-consuming and cause human errors. Yet, blockchain’s smart contract can save paperwork, minimize human labour efforts and reduce unnecessary costs. For instance, the payment can be transferred to producers automatically once the products arrive at the warehouse.</p>\n<p>Furthermore, the global supply chains become more complex with diverse policies to adapt in different countries. Globalized standardization can be adaptable for all countries by applying blockchain. So, companies can avoid duplicative works as well as can save resources and time.</p>\n<h3>8. Integration with Enterprise resource planning (ERP) and Internet of things (IoT)</h3>\n<p>Integrating ERP, IoT with blockchain technology can be highly beneficial. Enterprise resource planning (ERP) <a href=\"https://axxis-consulting.com/inventory-warehouse-management-module/\">streamlines inventory and production management processes</a> includes trade, logistics, delivery, warehousing information. While, IoT is an intelligent and high-speed information network that connects physical products through sensor includes GPS, GIS, RFID, WSN, etc.</p>\n<p>IoT devices capture accurate and real-time data in a continuous stream that can automatically feed into the internal ERP systems. Thus, no more manual recording or no human effort required to scan a barcode. This real-time information capturing ability is particularly important for frozen and fresh food products, as the quality is closely related to the external environment.</p>\n<p>The synergy between ERP, IoT and blockchain foster the exchange of immutable data along the supply chain and the smart contracts accelerate processing time. Analysis of massive quantities of reliable data leads to the right decisions. So, you can transform your operations from a reactive to a proactive approach.</p>\n<h3>Application of Blockchain technology in The Food Industry</h3>\n<p>Some prominent organizations have cooperated blockchain technology and enhanced their supply chains organizationally and technologically such as:</p>\n<h3>1. Walmart</h3>\n<p>Walmart collaborated with Chinese retailer JD.com, and Tsinghua University <a href=\"https://www.forbes.com/sites/rogeraitken/2017/12/14/ibm-walmart-launching-blockchain-food-safety-alliance-in-china-with-fortune-500s-jd-com/#4bc210967d9c\">to handle product safety issues</a> in food supply chains in China. Besides that, they are <a href=\"https://theleadershipnetwork.com/article/how-walmart-used-blockchain-to-increase-supply-chain-transparency\">tracing over 25 products</a> such as fresh fruits, leafy greens, dairy, meat, poultry from different suppliers. Beyond tracking the origin of products, Walmart aims to address food safety issues by identifying the source of a foodborne disease outbreak. Walmart will be coordinating more effective recalls of foods potentially contaminated. Moreover, it’s considering storing additional data to facilitate sustainable practices in the supply chain.</p>\n<h4>2. JD.com</h4>\n<p>JD.com China’s second-biggest online shopping has made it possible for customers to look at a <a href=\"https://qz.com/1031861/blockchain-could-fix-a-key-problem-in-chinas-food-industry-the-fear-of-food-made-in-china/\">detailed history of their steaks</a> — from when the cow was born to what it was eating before it’s served on their dinner tables.</p>\n<h3>3. Barilla</h3>\n<p>Barilla is using blockchain technology to guarantee the origin and quality of Italian fresh basil for its pesto.</p>\n<h3>4. Nestle and Carrefour</h3>\n<p>Nestle and Carrefour track baby milk products and provide consumers with data on their origins and movements “<a href=\"https://www.coindesk.com/nestle-carrefour-extend-blockchain-tracking-effort-to-baby-milk\">from dairy to shelf</a>.” Customers will be able to scan a QR code on the milk’s packaging to access a range of information.</p>\n<p>In addition, Carrefour also allows consumers to scan the QR Code on a product’s label such as organic chickens and Sicilian oranges and lemons to <a href=\"https://www.carrefour.com/en/group/food-transition/food-blockchain\">access information on their smartphone</a>.</p>\n<p>Most recently, Nestlé has announced that it will be expanding its use of blockchain technology to trace their <a href=\"https://www.forbes.com/sites/darrynpollock/2020/04/15/nestl-expands-use-of-ibm-food-trust-blockchain-to-its-zogas-coffee-brand/#20997f941684\">luxury coffee brand Zoégas</a>. Consumers can simply scan the QR code on the packaging and follow the coffee journey — from the growing locations to the Zoégas factory where the beans are roasted, grounded and packed. The data includes information about farmers, time of harvest, transaction certificate for the specific shipments, as well as the roasting period.</p>\n<h3>5. Alibaba</h3>\n<p>Alibaba has launched an initiative called “<a href=\"https://www.fastgrowthbrands.com/2018/05/weekly-focus-alibaba-trials-blockchain-for-supply-chain-transparency/\">Food Trust Framework</a>” which allows Chinese customers of Tmall Global (Alibaba-owned marketplace) to monitor shipments of food from Australia and New Zealand.</p>\n<h3>6. World Wildlife Fund (WWF)</h3>\n<p>The World Wildlife Fund (WWF) in Australia, Fiji and New Zealand, in partnership with high-tech, tuna fishing and processing companies, has launched a pilot project in the Pacific Islands tuna industry that will use <a href=\"https://www.business-humanrights.org/en/australia-wwf-partners-with-tech-cos-to-track-supply-chains-involved-in-environmental-harm-human-rights-abuses\">blockchain technology to fight against illegal tuna fishing</a> and to certify the origin of tuna through a QR Code.</p>\n<h3>Final words</h3>\n<p>By applying blockchain technology, companies in the food supply chain can communicate transparently to consumers and regulators. Moreover, it raises awareness about sustainability opportunities and practices at each step of the supply chain. Substantively, blockchain technology improves brand equity, reputation, and trustful relationships with consumers.</p>\n<blockquote>\n<em>“Blockchain is driving a new breed of enterprise applications that could drastically improve cooperation for wholesale distribution. The blockchain-based solution from SAP provides the best opportunity to fully satisfy our need to be interoperable with our trading partners and their solutions as well as to remain compliant with the U.S. DSCSA.”<br>– </em><a href=\"https://icn.sap.com/article/new-blockchain-software-from-sap-helps-eliminate-counterfeit-drugs\"><em>Jeffery Denton</em></a><em>, senior director, Global Secure Supply Chain, AmerisourceBergen Corporation.</em>\n</blockquote>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=ddf2d34cced6\" width=\"1\" height=\"1\" alt=\"\">\n","enclosure":{},"categories":["blockchain","food"]},{"title":"Must-have blockchain developer skills","pubDate":"2022-04-28 12:17:35","link":"https://medium.com/@IvooO/must-have-blockchain-developer-skills-e5bb323b1ad7?source=rss-5652217be6ca------2","guid":"https://medium.com/p/e5bb323b1ad7","author":"IvooO","thumbnail":"https://cdn-images-1.medium.com/max/727/1*g1SzikFavGm-qhVaA8jT9A.png","description":"\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/727/1*g1SzikFavGm-qhVaA8jT9A.png\"></figure><h3>Successfully navigating the many roles and responsibilities of a blockchain developer requires specialized skills ranging from cryptography to smart contracts to web development.</h3>\n<p>Blockchain has made inroads into a wide range of industries, extending far beyond its roots in cryptocurrency. As a result, demand has increased greatly for developers who are skilled in building blockchain networks and applications, inspiring many individuals to consider a career in blockchain development.</p>\n<p>Blockchain is a distributed digital ledger that provides a secure environment for transactions between participating members. A blockchain is essentially a decentralized database that’s managed by computers across a peer-to-peer network. The blockchain eliminates any single points of failure, while maintaining a permanent and tamperproof record of each transaction.</p>\n<p>A blockchain consists of blocks, each of which contains a unit of transactional data. The blocks are stored chronologically and linked together by hash functions. The hashing process makes it very difficult to change a block’s data once it’s been added to the chain, resulting in a highly secure and immutable system.</p>\n<p>Blockchain got its start with Bitcoin and similar digital currencies, but <a href=\"https://www.techtarget.com/searchcio/feature/Todays-blockchain-use-cases-and-industry-applications\">its benefits soon became apparent to other industries</a>, including <a href=\"https://www.techtarget.com/searchcio/feature/5-blockchain-use-cases-in-finance-that-show-value\">banking, financial services</a>, retail, energy, telecommunications, healthcare, education and government. Even companies like Amazon, Microsoft, Oracle and IBM are now promoting blockchain’s many benefits, although that’s mostly because they’re pushing blockchain services on their own platforms.</p>\n<p>But blockchain doesn’t need a cloud provider to sell industries on its virtues. Blockchain’s distributed ledger and shared architecture can <a href=\"https://www.techtarget.com/searchcio/feature/Top-10-benefits-of-blockchain-technology-for-business\">potentially benefit any business operation that requires a safe environment</a> for conducting secure and tamperproof transactions. Yet companies can’t implement blockchain solutions without qualified developers who possess very specialized skills to build their networks and applications.</p>\n<h3>Who is a blockchain developer?</h3>\n<p>Blockchain developers actively develop a blockchain network or decentralized application for that network. That doesn’t mean all blockchain developers are qualified professionals. But if they’re not, <a href=\"https://www.techtarget.com/searchcio/tip/5-challenges-with-blockchain-adoption-and-how-to-avoid-them\">they won’t be calling themselves blockchain developers for very long</a>.</p>\n<p>A qualified blockchain developer understands the blockchain architecture, underlying technologies and what it takes to implement the individual blockchain components into a unified system. The developer knows how cryptography and data structures fit into the blockchain structure, how to implement effective consensus protocols and how to build decentralized applications and <a href=\"https://searchcompliance.techtarget.com/definition/smart-contract\">smart contracts</a>.</p>\n<p>A blockchain developer is also proficient in the programming languages needed to build the blockchain components. Not every blockchain developer has the same level of skills in every area, but they all possess a wide breadth of knowledge about what it takes to deploy an effective blockchain network and its applications.</p>\n<h3>What are the roles and responsibilities of blockchain developers?</h3>\n<p>Blockchain developers have many roles and responsibilities. They might be responsible for the blockchain network, the applications that run on that network or a combination of both. They might also participate in designing blockchain networks and applications, analyzing existing systems and evaluating new technologies.</p>\n<p>The exact roles and responsibilities of a blockchain developer will depend on the individual’s circumstances, but they can include the following:</p>\n<ul>\n<li>researching, analyzing and designing blockchain networks, consensus protocols and decentralized applications;</li>\n<li>planning <a href=\"https://www.techtarget.com/searchcio/tip/8-blockchain-security-risks-to-weigh-before-adoption\">security and compliance across the entire blockchain network</a> and applying cryptographic mechanisms such as hash functions and digital signatures;</li>\n<li>researching and evaluating new tools and technologies and integrating them into a blockchain network or its applications;</li>\n<li>developing, testing, monitoring and maintaining a blockchain network, with a focus on performance, distributed computing, consensus protocols, cryptography and other security measures;</li>\n<li>developing, testing, monitoring and maintaining decentralized applications, smart contracts, back-end systems, client-side applications and any other components that make up the application stack;</li>\n<li>documenting development processes, artifacts and best practices as well as blockchain applications or systems; and</li>\n<li>employing a wide range of soft skills, including communication, collaboration, problem-solving, multitasking and working in a team environment.</li>\n</ul>\n<p>Blockchain developers might also be called upon to fulfill other tasks like participating in open source community projects, meeting with stakeholders, mentoring younger developers and learning new blockchain skills.</p>\n<h3>What are the types of blockchain developers?</h3>\n<p>Blockchain developers often wear many hats, depending on the size of their organizations and their specific situations. But most blockchain developers are typically classified as either core blockchain or blockchain software developers.</p>\n<ul>\n<li>Core blockchain developers are concerned primarily with the blockchain network and its underlying architecture. They plan and develop the network, design its consensus protocols, monitor and optimize the environment, determine how the network will interface with other services and ensure a <a href=\"https://www.techtarget.com/searchcio/tip/5-tips-to-successfully-implement-blockchain-for-businesses\">secure and efficient environment for implementing decentralized applications</a>.</li>\n<li>Blockchain software developers create decentralized applications and smart contracts to run on a blockchain network, taking into account the network’s architecture and consensus protocols. They might be responsible for both front-end and back-end development, as well as API development that supports blockchain integrations. They might also develop client-side applications for multiple device types.</li>\n</ul>\n<p>In some organizations, especially smaller ones, blockchain developers might fill both roles. Other organizations might assign additional roles. It all depends on the organization and the specific circumstances. The rising demand for smart contract development, for example, has led some teams to use smart contract engineers — individuals who develop and audit smart contracts and conduct end-to-end testing of business processes. Teams using blockchain developers specifically for back-end development is another example of how developer roles can vary.</p>\n<h3>Must-have blockchain developer skills</h3>\n<p>Qualified blockchain developers require a wide range of skills. When launching a career in blockchain development, it can be difficult to determine which skills are the most important to pursue. Job postings can give candidates some indications of what organizations want, but these “requirements” tend to be tailored toward a company’s specific needs. There are six essential blockchain developer skills, however, that every professional should possess.</p>\n<p><strong>1. Blockchain architecture.</strong> Blockchain developers should fully understand how blockchain works and the architecture on which it’s based. They should be well versed in concepts such as cryptography, consensus, hash functions, distributed ledgers, smart contracts and any other concepts integral to understanding blockchain’s inner workings. Developers should also be familiar with the <a href=\"https://www.techtarget.com/searchcio/feature/What-are-the-4-different-types-of-blockchain-technology\">four types of blockchain architecture</a>: consortium, private, public and hybrid.</p>\n<p><strong>2. Cryptography.</strong> Effective cryptography is essential to providing a secure blockchain environment, and developers should have a strong foundation in cryptographic concepts and practices, including wallets, keys and digital signatures. They should know how to use public-key cryptography to prevent unauthorized access to data and understand the differences between cryptographic hash functions like SHA-256 and Keccak-256.</p>\n<p><strong>3. Data structures.</strong> The entire blockchain network consists of data structures. Each block can be considered a type of data structure that clusters transactions for the public ledger. Blockchain developers must routinely work with data structures and should understand how the blockchain network uses them. They should also be familiar with the various types of data structures, such as graphs, heaps, hash trees, Patricia trees and Merkle trees.</p>\n<p><strong>4. Smart contracts.</strong> Smart contracts are self-executing contracts that enable two parties to exchange goods and services without an intermediary. Smart contracts have become a staple of blockchain implementations, and developers should have a thorough understanding of what they are and how they enforce business logic. Blockchain developers should also be familiar with the programming languages commonly used for smart contracts, such as Vyper, Solidity or Chaincode.</p>\n<p><strong>5. Web development.</strong> Blockchain and web development go hand in hand, especially with blockchain’s emphasis on decentralized applications. Blockchain developers should be experienced in all aspects of web development. That not only means knowing how to design and develop web applications, but also understanding the technologies that support these applications and what it takes to optimize and secure them.</p>\n<p><strong>6. Programming languages.</strong> Blockchain technologies often use different programming languages, <a href=\"https://www.techtarget.com/searchcio/feature/Top-9-blockchain-platforms-to-consider\">depending on the platforms used to implement the blockchain environments</a>. Although developers can’t be experts in every language, they still need to be proficient in any number of them. Some of the more common languages used for blockchain include Java, C++, Python and JavaScript. Developers should also have a strong foundation in object-oriented programming and be familiar with an assortment of development libraries and frameworks.</p>\n<p>Organizations hiring blockchain developers might weigh these skills differently, but all six are essential for an effective blockchain developer. Yet they’re not the only blockchain skills developers should possess. They should have basic skills such as understanding DevOps practices, using source control in a team setting, participating in code reviews, writing efficient and secure code and staying current on emerging technologies. They should also have strong cross-disciplinary skills and a good foundation in open standards and technologies that promote interoperability. And soft skills like communication and collaboration are essential to participate effectively in today’s Agile development environments.</p>\n<h3>How do you learn to become a blockchain developer?</h3>\n<p>There are no specific rules for becoming a blockchain developer, but professionals can take several steps toward a career in blockchain.</p>\n<ul>\n<li>Learn as much as possible about blockchain principles and fundamentals. Have a complete understanding of blockchain concepts such as cryptography, consensus, blockchain protocols, public-key encryption, decentralization, smart contracts, wallets, hashing and anything else that plays a role in blockchain architecture and operations.</li>\n<li>Read white papers, take courses, work through tutorials, participate in online training and <a href=\"https://www.techtarget.com/whatis/feature/8-top-blockchain-certification-courses-to-pursue\">pursue certifications in blockchain technologies</a>. A variety of free and low-cost resources are now available for learning blockchain.</li>\n<li>Get hands-on experience with all aspects of blockchain to better understand basic concepts. Try setting up a private blockchain network. Review decentralized applications available from resources like GitHub and post your own applications. Consider buying a small amount of cryptocurrency to see how it works from a user’s perspective.</li>\n<li>Familiarize yourself with the tools, technologies and platforms currently used in blockchain development, such as EOS, Ethereum, Ripple and <a href=\"https://www.techtarget.com/searchcio/definition/Hyperledger\">Hyperledger</a>. Learn their differences and when to use one over another. Take advantage of free trials to learn more about the different tools and better understand basic blockchain concepts.</li>\n<li>Join development groups and organizations. Participate in community events and forums. Talk with blockchain developers. Look for other opportunities to get involved in the blockchain community. <a href=\"https://www.techtarget.com/searchcio/feature/7-must-know-blockchain-trends\">Stay current by following blockchain news</a>.</li>\n</ul>\n<p>Organizations looking for blockchain developers typically want candidates with a degree in computer science or a related field. Although that’s not a hard-and-fast qualification, be aware that it may be an issue. Beyond that, there are many options for moving forward on a blockchain career trajectory.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=e5bb323b1ad7\" width=\"1\" height=\"1\" alt=\"\">\n","content":"\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/727/1*g1SzikFavGm-qhVaA8jT9A.png\"></figure><h3>Successfully navigating the many roles and responsibilities of a blockchain developer requires specialized skills ranging from cryptography to smart contracts to web development.</h3>\n<p>Blockchain has made inroads into a wide range of industries, extending far beyond its roots in cryptocurrency. As a result, demand has increased greatly for developers who are skilled in building blockchain networks and applications, inspiring many individuals to consider a career in blockchain development.</p>\n<p>Blockchain is a distributed digital ledger that provides a secure environment for transactions between participating members. A blockchain is essentially a decentralized database that’s managed by computers across a peer-to-peer network. The blockchain eliminates any single points of failure, while maintaining a permanent and tamperproof record of each transaction.</p>\n<p>A blockchain consists of blocks, each of which contains a unit of transactional data. The blocks are stored chronologically and linked together by hash functions. The hashing process makes it very difficult to change a block’s data once it’s been added to the chain, resulting in a highly secure and immutable system.</p>\n<p>Blockchain got its start with Bitcoin and similar digital currencies, but <a href=\"https://www.techtarget.com/searchcio/feature/Todays-blockchain-use-cases-and-industry-applications\">its benefits soon became apparent to other industries</a>, including <a href=\"https://www.techtarget.com/searchcio/feature/5-blockchain-use-cases-in-finance-that-show-value\">banking, financial services</a>, retail, energy, telecommunications, healthcare, education and government. Even companies like Amazon, Microsoft, Oracle and IBM are now promoting blockchain’s many benefits, although that’s mostly because they’re pushing blockchain services on their own platforms.</p>\n<p>But blockchain doesn’t need a cloud provider to sell industries on its virtues. Blockchain’s distributed ledger and shared architecture can <a href=\"https://www.techtarget.com/searchcio/feature/Top-10-benefits-of-blockchain-technology-for-business\">potentially benefit any business operation that requires a safe environment</a> for conducting secure and tamperproof transactions. Yet companies can’t implement blockchain solutions without qualified developers who possess very specialized skills to build their networks and applications.</p>\n<h3>Who is a blockchain developer?</h3>\n<p>Blockchain developers actively develop a blockchain network or decentralized application for that network. That doesn’t mean all blockchain developers are qualified professionals. But if they’re not, <a href=\"https://www.techtarget.com/searchcio/tip/5-challenges-with-blockchain-adoption-and-how-to-avoid-them\">they won’t be calling themselves blockchain developers for very long</a>.</p>\n<p>A qualified blockchain developer understands the blockchain architecture, underlying technologies and what it takes to implement the individual blockchain components into a unified system. The developer knows how cryptography and data structures fit into the blockchain structure, how to implement effective consensus protocols and how to build decentralized applications and <a href=\"https://searchcompliance.techtarget.com/definition/smart-contract\">smart contracts</a>.</p>\n<p>A blockchain developer is also proficient in the programming languages needed to build the blockchain components. Not every blockchain developer has the same level of skills in every area, but they all possess a wide breadth of knowledge about what it takes to deploy an effective blockchain network and its applications.</p>\n<h3>What are the roles and responsibilities of blockchain developers?</h3>\n<p>Blockchain developers have many roles and responsibilities. They might be responsible for the blockchain network, the applications that run on that network or a combination of both. They might also participate in designing blockchain networks and applications, analyzing existing systems and evaluating new technologies.</p>\n<p>The exact roles and responsibilities of a blockchain developer will depend on the individual’s circumstances, but they can include the following:</p>\n<ul>\n<li>researching, analyzing and designing blockchain networks, consensus protocols and decentralized applications;</li>\n<li>planning <a href=\"https://www.techtarget.com/searchcio/tip/8-blockchain-security-risks-to-weigh-before-adoption\">security and compliance across the entire blockchain network</a> and applying cryptographic mechanisms such as hash functions and digital signatures;</li>\n<li>researching and evaluating new tools and technologies and integrating them into a blockchain network or its applications;</li>\n<li>developing, testing, monitoring and maintaining a blockchain network, with a focus on performance, distributed computing, consensus protocols, cryptography and other security measures;</li>\n<li>developing, testing, monitoring and maintaining decentralized applications, smart contracts, back-end systems, client-side applications and any other components that make up the application stack;</li>\n<li>documenting development processes, artifacts and best practices as well as blockchain applications or systems; and</li>\n<li>employing a wide range of soft skills, including communication, collaboration, problem-solving, multitasking and working in a team environment.</li>\n</ul>\n<p>Blockchain developers might also be called upon to fulfill other tasks like participating in open source community projects, meeting with stakeholders, mentoring younger developers and learning new blockchain skills.</p>\n<h3>What are the types of blockchain developers?</h3>\n<p>Blockchain developers often wear many hats, depending on the size of their organizations and their specific situations. But most blockchain developers are typically classified as either core blockchain or blockchain software developers.</p>\n<ul>\n<li>Core blockchain developers are concerned primarily with the blockchain network and its underlying architecture. They plan and develop the network, design its consensus protocols, monitor and optimize the environment, determine how the network will interface with other services and ensure a <a href=\"https://www.techtarget.com/searchcio/tip/5-tips-to-successfully-implement-blockchain-for-businesses\">secure and efficient environment for implementing decentralized applications</a>.</li>\n<li>Blockchain software developers create decentralized applications and smart contracts to run on a blockchain network, taking into account the network’s architecture and consensus protocols. They might be responsible for both front-end and back-end development, as well as API development that supports blockchain integrations. They might also develop client-side applications for multiple device types.</li>\n</ul>\n<p>In some organizations, especially smaller ones, blockchain developers might fill both roles. Other organizations might assign additional roles. It all depends on the organization and the specific circumstances. The rising demand for smart contract development, for example, has led some teams to use smart contract engineers — individuals who develop and audit smart contracts and conduct end-to-end testing of business processes. Teams using blockchain developers specifically for back-end development is another example of how developer roles can vary.</p>\n<h3>Must-have blockchain developer skills</h3>\n<p>Qualified blockchain developers require a wide range of skills. When launching a career in blockchain development, it can be difficult to determine which skills are the most important to pursue. Job postings can give candidates some indications of what organizations want, but these “requirements” tend to be tailored toward a company’s specific needs. There are six essential blockchain developer skills, however, that every professional should possess.</p>\n<p><strong>1. Blockchain architecture.</strong> Blockchain developers should fully understand how blockchain works and the architecture on which it’s based. They should be well versed in concepts such as cryptography, consensus, hash functions, distributed ledgers, smart contracts and any other concepts integral to understanding blockchain’s inner workings. Developers should also be familiar with the <a href=\"https://www.techtarget.com/searchcio/feature/What-are-the-4-different-types-of-blockchain-technology\">four types of blockchain architecture</a>: consortium, private, public and hybrid.</p>\n<p><strong>2. Cryptography.</strong> Effective cryptography is essential to providing a secure blockchain environment, and developers should have a strong foundation in cryptographic concepts and practices, including wallets, keys and digital signatures. They should know how to use public-key cryptography to prevent unauthorized access to data and understand the differences between cryptographic hash functions like SHA-256 and Keccak-256.</p>\n<p><strong>3. Data structures.</strong> The entire blockchain network consists of data structures. Each block can be considered a type of data structure that clusters transactions for the public ledger. Blockchain developers must routinely work with data structures and should understand how the blockchain network uses them. They should also be familiar with the various types of data structures, such as graphs, heaps, hash trees, Patricia trees and Merkle trees.</p>\n<p><strong>4. Smart contracts.</strong> Smart contracts are self-executing contracts that enable two parties to exchange goods and services without an intermediary. Smart contracts have become a staple of blockchain implementations, and developers should have a thorough understanding of what they are and how they enforce business logic. Blockchain developers should also be familiar with the programming languages commonly used for smart contracts, such as Vyper, Solidity or Chaincode.</p>\n<p><strong>5. Web development.</strong> Blockchain and web development go hand in hand, especially with blockchain’s emphasis on decentralized applications. Blockchain developers should be experienced in all aspects of web development. That not only means knowing how to design and develop web applications, but also understanding the technologies that support these applications and what it takes to optimize and secure them.</p>\n<p><strong>6. Programming languages.</strong> Blockchain technologies often use different programming languages, <a href=\"https://www.techtarget.com/searchcio/feature/Top-9-blockchain-platforms-to-consider\">depending on the platforms used to implement the blockchain environments</a>. Although developers can’t be experts in every language, they still need to be proficient in any number of them. Some of the more common languages used for blockchain include Java, C++, Python and JavaScript. Developers should also have a strong foundation in object-oriented programming and be familiar with an assortment of development libraries and frameworks.</p>\n<p>Organizations hiring blockchain developers might weigh these skills differently, but all six are essential for an effective blockchain developer. Yet they’re not the only blockchain skills developers should possess. They should have basic skills such as understanding DevOps practices, using source control in a team setting, participating in code reviews, writing efficient and secure code and staying current on emerging technologies. They should also have strong cross-disciplinary skills and a good foundation in open standards and technologies that promote interoperability. And soft skills like communication and collaboration are essential to participate effectively in today’s Agile development environments.</p>\n<h3>How do you learn to become a blockchain developer?</h3>\n<p>There are no specific rules for becoming a blockchain developer, but professionals can take several steps toward a career in blockchain.</p>\n<ul>\n<li>Learn as much as possible about blockchain principles and fundamentals. Have a complete understanding of blockchain concepts such as cryptography, consensus, blockchain protocols, public-key encryption, decentralization, smart contracts, wallets, hashing and anything else that plays a role in blockchain architecture and operations.</li>\n<li>Read white papers, take courses, work through tutorials, participate in online training and <a href=\"https://www.techtarget.com/whatis/feature/8-top-blockchain-certification-courses-to-pursue\">pursue certifications in blockchain technologies</a>. A variety of free and low-cost resources are now available for learning blockchain.</li>\n<li>Get hands-on experience with all aspects of blockchain to better understand basic concepts. Try setting up a private blockchain network. Review decentralized applications available from resources like GitHub and post your own applications. Consider buying a small amount of cryptocurrency to see how it works from a user’s perspective.</li>\n<li>Familiarize yourself with the tools, technologies and platforms currently used in blockchain development, such as EOS, Ethereum, Ripple and <a href=\"https://www.techtarget.com/searchcio/definition/Hyperledger\">Hyperledger</a>. Learn their differences and when to use one over another. Take advantage of free trials to learn more about the different tools and better understand basic blockchain concepts.</li>\n<li>Join development groups and organizations. Participate in community events and forums. Talk with blockchain developers. Look for other opportunities to get involved in the blockchain community. <a href=\"https://www.techtarget.com/searchcio/feature/7-must-know-blockchain-trends\">Stay current by following blockchain news</a>.</li>\n</ul>\n<p>Organizations looking for blockchain developers typically want candidates with a degree in computer science or a related field. Although that’s not a hard-and-fast qualification, be aware that it may be an issue. Beyond that, there are many options for moving forward on a blockchain career trajectory.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=e5bb323b1ad7\" width=\"1\" height=\"1\" alt=\"\">\n","enclosure":{},"categories":["web-development","skills","blockchain"]},{"title":"TRY-OUTS","pubDate":"2017-03-05 11:07:56","link":"https://medium.com/series/try-outs-bbac00bfdd93?source=rss-5652217be6ca------2","guid":"https://medium.com/p/bbac00bfdd93","author":"IvooO","thumbnail":"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=bbac00bfdd93","description":"\n<p></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=bbac00bfdd93\" width=\"1\" height=\"1\" alt=\"\">\n","content":"\n<p></p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=bbac00bfdd93\" width=\"1\" height=\"1\" alt=\"\">\n","enclosure":{},"categories":[]}]}